using System.Reflection;
using System.Text;
using System.Text.Json;

namespace AeroSpace.Access.Tests;


public partial class AccessComputeV2Tests
{
    /*  测试 地球 LEO卫星-带传感器- GEO 卫星 Access
     
        LEO卫星： Z轴绕 ICRF.Z 旋转，2°/s   
            -   传感器： 45°半锥角

        GEO卫星： 静止在赤道上空

        由于旋转的LEO卫星传感器视场不断变化，导致Access时间段与静止传感器不同

        传感器的姿态由LEO卫星姿态和传感器的指向综合，采用CzmlOrientation形式           
                
        STK 结果

  Access        Start Time (UTCG)           Stop Time (UTCG)        Duration (sec)
                  ------    ------------------------    ------------------------    --------------
                       1    25 Apr 2022 04:00:00.000    25 Apr 2022 04:00:22.456            22.456
                       2    25 Apr 2022 04:02:37.933    25 Apr 2022 04:03:23.043            45.110
                       3    25 Apr 2022 04:05:38.580    25 Apr 2022 04:06:23.572            44.992
                       4    25 Apr 2022 04:08:39.218    25 Apr 2022 04:09:24.050            44.832
                       5    25 Apr 2022 04:11:39.834    25 Apr 2022 04:12:24.470            44.636
                       6    25 Apr 2022 04:14:40.394    25 Apr 2022 04:15:24.852            44.458
                       7    25 Apr 2022 04:17:40.892    25 Apr 2022 04:18:25.191            44.298
                       8    25 Apr 2022 04:20:41.310    25 Apr 2022 04:21:25.511            44.202
                       9    25 Apr 2022 04:23:41.656    25 Apr 2022 04:24:25.802            44.147
                      10    25 Apr 2022 04:26:41.922    25 Apr 2022 04:27:26.085            44.163
                      11    25 Apr 2022 04:29:42.132    25 Apr 2022 04:30:26.349            44.217
                      12    25 Apr 2022 04:32:42.286    25 Apr 2022 04:33:26.610            44.324
                      13    25 Apr 2022 05:14:45.758    25 Apr 2022 05:15:30.155            44.397
                      14    25 Apr 2022 05:17:46.369    25 Apr 2022 05:18:30.620            44.251
                      15    25 Apr 2022 05:20:47.025    25 Apr 2022 05:21:31.171            44.146
                      16    25 Apr 2022 05:23:47.731    25 Apr 2022 05:24:31.797            44.066

                            
        与STK对比:   <0.1s

        20251212    初次创建           
     */

    [TestMethod()]
    public void Earth_SpinSensor_Czml_251212()
    {
        //  输入json文件的路径            
        string filePath0 = new DirectoryInfo(Assembly.GetExecutingAssembly().Location).Parent.FullName;
        filePath0 = Path.Combine(filePath0, @"Access");

        //  读取输入参数(json)
        string fp = Path.Combine(filePath0, "Earth_SpinSensor_Czml_251212.json");

        //  读取json文件，并序列化为类对象
        string inputStr = File.ReadAllText(fp, Encoding.UTF8);
        var input = JsonSerializer.Deserialize<AccessInput2>(inputStr);

        //  Access计算
        var output = AccessComputeV2.Compute(input);

        //  检查部分参数的正确性
        Assert.IsTrue(output.IsSuccess);
        Console.WriteLine(output.ToString());

        double ebsl = 0.1;
        Assert.AreEqual(22.574, output.Passes[0].Duration, ebsl);
        Assert.AreEqual(45.112, output.Passes[1].Duration, ebsl);
        Assert.AreEqual(44.999, output.Passes[2].Duration, ebsl);
    }

    /*
    Access        Start Time (UTCG)           Stop Time (UTCG)        Duration (sec)
------    ------------------------    ------------------------    --------------
     1    2022-04-25T04:00:00.000Z    2022-04-25T04:00:22.574Z            22.574
     2    2022-04-25T04:02:38.047Z    2022-04-25T04:03:23.159Z            45.112
     3    2022-04-25T04:05:38.693Z    2022-04-25T04:06:23.692Z            44.999
     4    2022-04-25T04:08:39.336Z    2022-04-25T04:09:24.169Z            44.832
     5    2022-04-25T04:11:39.952Z    2022-04-25T04:12:24.596Z            44.643
     6    2022-04-25T04:14:40.518Z    2022-04-25T04:15:24.978Z            44.459
     7    2022-04-25T04:17:41.018Z    2022-04-25T04:18:25.325Z            44.307
     8    2022-04-25T04:20:41.442Z    2022-04-25T04:21:25.645Z            44.203
     9    2022-04-25T04:23:41.789Z    2022-04-25T04:24:25.945Z            44.156
    10    2022-04-25T04:26:42.063Z    2022-04-25T04:27:26.229Z            44.166
    11    2022-04-25T04:29:42.274Z    2022-04-25T04:30:26.500Z            44.226
    12    2022-04-25T04:32:42.435Z    2022-04-25T04:33:26.760Z            44.325
    13    2022-04-25T05:14:45.912Z    2022-04-25T05:15:30.305Z            44.393
    14    2022-04-25T05:17:46.516Z    2022-04-25T05:18:30.771Z            44.255
    15    2022-04-25T05:20:47.171Z    2022-04-25T05:21:31.313Z            44.143
    16    2022-04-25T05:23:47.868Z    2022-04-25T05:24:31.939Z            44.071
    17    2022-04-25T05:26:48.599Z    2022-04-25T05:27:32.652Z            44.053
    18    2022-04-25T05:29:49.352Z    2022-04-25T05:30:33.449Z            44.097
    19    2022-04-25T05:32:50.114Z    2022-04-25T05:33:34.317Z            44.203
    20    2022-04-25T05:35:50.874Z    2022-04-25T05:36:35.237Z            44.362
    21    2022-04-25T05:38:51.622Z    2022-04-25T05:39:36.179Z            44.556
    22    2022-04-25T05:41:52.344Z    2022-04-25T05:42:37.102Z            44.758
    23    2022-04-25T05:44:53.033Z    2022-04-25T05:45:37.969Z            44.936
    24    2022-04-25T05:47:53.676Z    2022-04-25T05:48:38.743Z            45.067
    25    2022-04-25T05:50:54.266Z    2022-04-25T05:51:39.392Z            45.126
    26    2022-04-25T05:53:54.793Z    2022-04-25T05:54:39.906Z            45.112
    27    2022-04-25T05:56:55.248Z    2022-04-25T05:57:40.272Z            45.024
    28    2022-04-25T05:59:55.618Z    2022-04-25T06:00:00.000Z             4.382

     */

}